# MacroModule Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Macro..::..MacroModule Property
Macro Class See Also
---
The Macro module.
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public MacroModule MacroModule { get; }
```

Visual Basic
---
```text
Public ReadOnly Property MacroModule As MacroModule
	Get
```

Visual C++
---
```text
public:
property MacroModule^ MacroModule {
	MacroModule^ get ();
}
```

# See Also
Macro Class
Autodesk.Revit.DB.Macros Namespace